#### OpenTofu Format and Style 🖌`success`
  #### OpenTofu Initialization ⚙️`success`
  #### TFLint ☑️`success`
  #### OpenTofu Validation 🤖`success`
  <details><summary>Validation Output</summary>

  ```

  Success! The configuration is valid.

  ```

  </details>

  #### OpenTofu Plan 📖`success`

  <details><summary>Show Plan</summary>

  ```

  module.data.module.onepassword.data.onepassword_vault.swag_lgbt: Reading...
module.data.module.onepassword.data.onepassword_vault.swag_lgbt: Read complete after 0s [id=vaults/syp4svuf7qzbcuu5umljoo4bb4]
module.data.module.onepassword.data.onepassword_item.digitalocean_access_token: Reading...
module.data.module.onepassword.data.onepassword_item.cloudflare_api_token: Reading...
module.data.module.onepassword.data.onepassword_item.onepassword_service_account_token: Reading...
module.data.module.onepassword.data.onepassword_item.onepassword_service_account_token: Read complete after 1s [id=vaults/syp4svuf7qzbcuu5umljoo4bb4/items/oj6efv7u5w6so5a35icnca7lae]
module.data.module.onepassword.data.onepassword_item.digitalocean_access_token: Read complete after 1s [id=vaults/syp4svuf7qzbcuu5umljoo4bb4/items/v5un5i5yzxapu2r3j5t6llivqu]
module.data.module.onepassword.data.onepassword_item.cloudflare_api_token: Read complete after 1s [id=vaults/syp4svuf7qzbcuu5umljoo4bb4/items/olodum4evqjyj2znrkx62tuwve]
module.infra.module.tunnel.data.onepassword_item.tunnel_ssh_key: Reading...
module.apps.module.passport.data.onepassword_item.stytch_api_subdomain: Reading...
module.data.module.cloudflare.data.cloudflare_zone.swag_lgbt: Reading...
module.infra.module.kubernetes.data.digitalocean_kubernetes_versions.swag_lgbt: Reading...
module.data.module.cloudflare.data.cloudflare_zone.swag_lgbt: Read complete after 0s [id=243f037e4db09925df6e0c04681b4971]
module.apps.module.passport.data.onepassword_item.stytch_api_subdomain: Read complete after 0s [id=vaults/syp4svuf7qzbcuu5umljoo4bb4/items/txtiult7ny4zu2vpm76t43okjq]
module.infra.module.tunnel.data.onepassword_item.tunnel_ssh_key: Read complete after 0s [id=vaults/syp4svuf7qzbcuu5umljoo4bb4/items/zubwpafvtodcm5s4x7cra4doqa]
module.infra.module.kubernetes.data.digitalocean_kubernetes_versions.swag_lgbt: Read complete after 0s [id=terraform-20240508172214205500000001]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.apps.module.passport.cloudflare_pages_domain.passport will be created
  + resource "cloudflare_pages_domain" "passport" {
      + account_id   = "8046ced7e2c70129d1732280998af108"
      + domain       = "account.swag.lgbt"
      + id           = (known after apply)
      + project_name = "swag-lgbt-passport"
      + status       = (known after apply)
    }

  # module.apps.module.passport.cloudflare_pages_project.passport will be created
  + resource "cloudflare_pages_project" "passport" {
      + account_id        = "8046ced7e2c70129d1732280998af108"
      + created_on        = (known after apply)
      + domains           = (known after apply)
      + id                = (known after apply)
      + name              = "swag-lgbt-passport"
      + production_branch = "main"
      + subdomain         = (known after apply)

      + build_config {
          + build_caching   = true
          + build_command   = "pnpm pages:build"
          + destination_dir = ".vercel/output/static"
          + root_dir        = "apps/passport"
        }

      + source {
          + type = "github"

          + config {
              + deployments_enabled           = true
              + owner                         = "swagLGBT"
              + pr_comments_enabled           = true
              + preview_branch_excludes       = (known after apply)
              + preview_branch_includes       = (known after apply)
              + preview_deployment_setting    = "all"
              + production_branch             = "main"
              + production_deployment_enabled = true
              + repo_name                     = "swagLGBT"
            }
        }
    }

  # module.apps.module.passport.cloudflare_record.passport will be created
  + resource "cloudflare_record" "passport" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "account"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "243f037e4db09925df6e0c04681b4971"
    }

  # module.apps.module.passport.cloudflare_record.stytch will be created
  + resource "cloudflare_record" "stytch" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "api.stytch"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 3600
      + type            = "CNAME"
      + value           = "fuchsia-radium-8372.customers.stytch.com"
      + zone_id         = "243f037e4db09925df6e0c04681b4971"
    }

  # module.infra.module.kubernetes.digitalocean_kubernetes_cluster.main will be created
  + resource "digitalocean_kubernetes_cluster" "main" {
      + auto_upgrade                     = true
      + cluster_subnet                   = (known after apply)
      + created_at                       = (known after apply)
      + destroy_all_associated_resources = false
      + endpoint                         = (known after apply)
      + ha                               = false
      + id                               = (known after apply)
      + ipv4_address                     = (known after apply)
      + kube_config                      = (sensitive value)
      + name                             = "swag-lgbt-k8s-main"
      + region                           = "nyc3"
      + registry_integration             = false
      + service_subnet                   = (known after apply)
      + status                           = (known after apply)
      + surge_upgrade                    = true
      + updated_at                       = (known after apply)
      + urn                              = (known after apply)
      + version                          = "1.29.1-do.0"
      + vpc_uuid                         = (known after apply)

      + maintenance_policy {
          + day        = "saturday"
          + duration   = (known after apply)
          + start_time = "08:00"
        }

      + node_pool {
          + actual_node_count = (known after apply)
          + auto_scale        = true
          + id                = (known after apply)
          + max_nodes         = 3
          + min_nodes         = 1
          + name              = "swag-lgbt-node-pool"
          + nodes             = (known after apply)
          + size              = "c-2"
        }
    }

  # module.infra.module.postgres.digitalocean_database_cluster.postgres will be created
  + resource "digitalocean_database_cluster" "postgres" {
      + database             = (known after apply)
      + engine               = "pg"
      + host                 = (known after apply)
      + id                   = (known after apply)
      + name                 = "swag-lgbt-postgres"
      + node_count           = 1
      + password             = (sensitive value)
      + port                 = (known after apply)
      + private_host         = (known after apply)
      + private_network_uuid = (known after apply)
      + private_uri          = (sensitive value)
      + project_id           = (known after apply)
      + region               = "nyc3"
      + size                 = "db-s-1vcpu-2gb"
      + storage_size_mib     = "30720"
      + ui_database          = (known after apply)
      + ui_host              = (known after apply)
      + ui_password          = (sensitive value)
      + ui_port              = (known after apply)
      + ui_uri               = (sensitive value)
      + ui_user              = (known after apply)
      + uri                  = (sensitive value)
      + urn                  = (known after apply)
      + user                 = (known after apply)
      + version              = "16"

      + maintenance_window {
          + day  = "sunday"
          + hour = "08:00"
        }
    }

  # module.infra.module.postgres.digitalocean_database_firewall.postgres will be created
  + resource "digitalocean_database_firewall" "postgres" {
      + cluster_id = (known after apply)
      + id         = (known after apply)

      + rule {
          + created_at = (known after apply)
          + type       = "droplet"
          + uuid       = (known after apply)
          + value      = (known after apply)
        }
      + rule {
          + created_at = (known after apply)
          + type       = "k8s"
          + uuid       = (known after apply)
          + value      = (known after apply)
        }
    }

  # module.infra.module.postgres.onepassword_item.postgres_admin_credentials will be created
  + resource "onepassword_item" "postgres_admin_credentials" {
      + category = "database"
      + database = (known after apply)
      + hostname = (known after apply)
      + id       = (known after apply)
      + password = (sensitive value)
      + port     = (known after apply)
      + tags     = [
          + "DigitalOcean",
        ]
      + title    = "DigitalOcean Managed Postgres"
      + type     = "postgresql"
      + username = (known after apply)
      + uuid     = (known after apply)
      + vault    = (sensitive value)
    }

  # module.infra.module.tunnel.digitalocean_droplet.tunnel will be created
  + resource "digitalocean_droplet" "tunnel" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + droplet_agent        = true
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-20-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = true
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = false
      + name                 = "swag-lgbt-ssh-tunnel"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "nyc3"
      + resize_disk          = false
      + size                 = "s-1vcpu-1gb"
      + ssh_keys             = (known after apply)
      + status               = (known after apply)
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # module.infra.module.tunnel.digitalocean_ssh_key.tunnel will be created
  + resource "digitalocean_ssh_key" "tunnel" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = (sensitive value)
      + public_key  = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKmTNrm6zX5J9t30zDcNGvHzPGw9MqbhTL//rukhNRba"
    }

  # module.infra.module.vpc.digitalocean_vpc.main will be created
  + resource "digitalocean_vpc" "main" {
      + created_at = (known after apply)
      + default    = (known after apply)
      + id         = (known after apply)
      + ip_range   = (known after apply)
      + name       = "swag-lgbt-vpc"
      + region     = "nyc3"
      + urn        = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/home/runner/work/swagLGBT/swagLGBT/tofu-plan-more-ci-bullshit-9005930695

To perform exactly these actions, run the following command to apply:
    tofu apply "/home/runner/work/swagLGBT/swagLGBT/tofu-plan-more-ci-bullshit-9005930695"

  ```

  </details>